/**/
"Cancel" = "ยกเลิก";
/**/
"Delete" = "ลบ";
/**/
"Open" = "เปิด";
/**/
"Edit" = "แก้ไข";
/**/
"Yes" = "ใช่";
/**/
"Finish" = "จบ";
/**/
"Done" = "เสร็จสิ้น";
/**/
"Save" = "บันทึก";
/**/
"Undo" = "ยกเลิกสิ่งที่ทำก่อนหน้า";
/**/
"Redo" = "ทำอีกครั้ง";
/**/
"OK" = "ตกลง";
/**/
"Yes Delete" = "ลบ";


/*Geometry Edit Action Name*/
"Apply Geometry" = "ใช้ระบบเรขาคณิต";
/*Geometry Edit Action Name*/
"Clear Geometry" = "ลบรูปเรขาคณิต";
/*Geometry Edit Action Name*/
"Delete Vertex" = "ลบจุดเชื่อมต่อ";
/*Geometry Edit Action Name*/
"Insert Part" = "แทรกส่วน";
/*Geometry Edit Action Name*/
"Insert Vertex" = "แทรกจุดเชื่อมต่อ";
/*Geometry Edit Action Name*/
"Move Vertex" = "ย้ายจุดเชื่อมต่อ";
/*Geometry Edit Action Name*/
"Remove Part" = "ลบบางส่วนออก";

/*Collecting attachments*/
"Add" = "เพิ่ม";
/*Collecting attachments*/
"Take Photo or Video" = "ถ่ายรูปภาพหรือวิดิโอ";
/*Collecting attachments*/
"Choose From Library" = "เลือกจากคลังภาพ";
/*Collecting attachments*/
"Photo" = "รูปภาพ";
/*Collecting attachments*/
"Video" = "วิดีโอ";
/*Collecting attachments*/
"Save To Photo Library" = "บันทึกในคลังภาพ";
/*Collecting attachments*/
"Download" = "ดาวน์โหลด";

/*Date attribute*/
"Today" = "วันนี้";

/**/
"Attachments" = "แนบ";
"Attributes" = "ข้อมูลคุณลักษณะ";

/**/
"Open in Safari" = "เปิดใน Safari";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "ใส่หมายเลขระหว่าง %i และ %i.";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "ใส่หมายเลขระหว่าง %@ และ %@.";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "มีตัวอักษรมากเกินไป (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "ตัวเลขไม่ได้อยู่ในขอบเขตที่กำหนด";

/* BLOB, RASTER, etc */
"Field type not supported" = "ประเภทฟิลด์ที่ไม่รองรับ";

/**/
"%d of %d" = "%d จาก %d";

/**/
"Changing Feature Type" = "เปลี่ยนประเภทฟีเจอร์";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "คุณกำลังเปลี่ยนประเภทฟีเจอร์ ซึ่งอาจมีการเปลี่ยนแปลงค่าในข้อมูลเชิงบรรยาย คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?";

/**/
"Deleting Feature" = "กำลังลบฟีเจอร์";
"Are you sure you want to delete this feature?" = "คุณต้องการลบฟีเจอร์นี้ใช่หรือไม่?";

/**/
"Data for pie chart is invalid" = "ข้อมูลสำหรับแผนภูมิวงกลมไม่ถูกต้อง";
"No data to create a pie chart" = "ไม่มีข้อมูลสำหรับสร้างแผนภูมิวงกลม";
"No image to display" = "ไม่มีภาพที่จะแสดง";

/**/
"Created by %@ seconds ago" = "สร้างโดย %@ วินาทีที่แล้ว";

/**/
"Created by %@ a minute ago" = "สร้างโดย %@ เมื่อหนึ่งนาทีที่แล้ว";

/**/
"Edited by %@ seconds ago" = "แก้ไขโดย %@ วินาทีที่แล้ว";

/**/
"Edited by %@ a minute ago" = "แก้ไขโดย %@ เมื่อหนึ่งนาทีที่แล้ว";

/**/
"Created seconds ago" = "สร้างเมื่อไม่กี่วินาทีที่แล้ว";

/**/
"Created a minute ago" = "สร้างเมื่อไม่กี่นาทีที่แล้ว";

/**/
"Edited seconds ago" = "แก้ไขเมื่อวินาทีที่แล้ว";

/**/
"Edited a minute ago" = "แก้เมื่อนาทีที่แล้ว";

/**/
"Created by %@ %d minutes ago" = "สร้างโดย %@ %d นาทีที่แล้ว";

/**/
"Created by %@ an hour ago" = "สร้างโดย %@ เมื่อหนึ่งชั่วโมงที่แล้ว";

/**/
"Created by %@ %d hours ago" = "สร้างโดย %@ %d ชั่วโมงที่แล้ว";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "สร้างโดย %@ เมื่อ %@ เวลา %@";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "สร้างโดย %@ เมื่อ %@ เวลา %@";

/**/
"Edited by %@ %d minutes ago" = "แก้ไขโดย %@ %d นาททีที่แล้ว";

/**/
"Edited by %@ an hour ago" = "แก้ไขโดย %@ เมื่อหนึ่งชั่วโมงที่แล้ว";

/**/
"Edited by %@ %d hours ago" = "แก้ไขโดย %@ %d ชั่วโมงที่แล้ว";

/**/
"Edited by %@ on %@ at %@ - day" = "แก้ไขโดย %@ เมื่อ %@ เวลา %@";

/**/
"Edited by %@ on %@ at %@ - full" = "แก้ไขโดย %@ เมื่อ %@ เวลา %@";

/**/
"Created by %@" = "สร้างโดย %@";

/**/
"Edited by %@" = "แก้ไขโดย %@";

/**/
"Created %d minutes ago" = "สร้างเมื่อ %d นาทีที่แล้ว";

/**/
"Created an hour ago" = "สร้างเมื่อไม่กี่ชั่วโมงที่แล้ว";

/**/
"Created %d hours ago" = "สร้างเมื่อ %d ชั่วโมงที่แล้ว";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "สร้างเมื่อ %@ เวลา %@";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "สร้างเมื่อ %@ เวลา %@";

/**/
"Edited %d minutes ago" = "แก้ไขเมื่อ %d นาทีที่แล้ว";

/**/
"Edited an hour ago" = "แก้ไขเมื่อชั่่วโมงที่แล้ว";

/**/
"Edited %d hours ago" = "แก้ไขเมื่อ %d ชั่วโมงที่แล้ว";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "แก้ไขเมื่อ %@ เวลา %@";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "แก้ไขเมื่อ %@ เวลา %@";

/* Used to denote a required field */
"Required" = "ต้องการ";

/* Used for naming layers with no names */
"Layer %d" = "ชั้นข้อมูล %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "ไม่พบที่อยู่สำหรับตำแหน่ง";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "ไม่พบตำแหน่งสำหรับที่อยู่";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "ไม่สามารถอ่านที่อยู่ได้";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "ไม่พบไฟล์ที่ค้นหา";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "ไม่สามารถโหลดตัวระบุตำแหน่งได้";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "ข้อผิดพลาดตัวระบุตำแหน่งภายใน";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "Intersections Geocoding ไม่รองรับโดย Locator";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "คุณสมบัติตัวระบุตำแหน่งไม่ถูกต้อง";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "ต้องการในส่วนที่หายไป";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "ตัวระบุตำแหน่งยังไม่เริ่มต้นใช้งาน";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "ประเภทของ Locator ที่ไม่รองรับ";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "การแปลงระบบพิกัดที่ไม่รองรับ";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "ระบบพิกัดที่ไม่รองรับ";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "Reverse Geocoding ไม่รองรับกับ Locator นี้";

/* Network analyst errors */
"Cannot open network." = "ไม่สามารถเปิดเน็ตเวิร์คได้";
"Cannot retrieve route task parameters." = "ไม่สามารถกู้คืนตัวแปรงานวางแผนเส้นทางได้";
"Insufficient number of stops." = "จำนวนจุดหยุดไม่เพียงพอ";
"Stop (%@) was not located." = "จุด (%@) ยังไม่ได้ถูกระบุตำแหน่ง";
"Stop (%@) is located on a non traversable element." = "จุด (%@) ถูกวางอยู่บนส่วนประกอบที่ย้ายข้ามไม่ได้";
"Stop (%@) is located on a soft restricted element." = "จุด (%@) ถูกวางอยู่บนส่วนประกอบที่เข้มงวด";
"Point barrier (%@) was not located." = "Point barrier (%@) ไม่ได้ถูกระบุตำแหน่ง";
"Point barrier (%@) has invalid added cost attribute name." = "Point barrier (%@) มีชื่อข้อมูลเชิงบรรยายไม่ถูกต้อง";
"Line barrier (%@) has invalid scaled cost attribute name." = "Line barrier (%@) มีชื่อข้อมูลมาตราส่วนเชิงบรรยายไม่ถูกต้อง";
"Line barrier (%@) does not cover any network elements." = "Line barrier (%@) ไม่ครอบคลุมส่วนประกอบเน็ตเวิร์คใดๆ";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "Polygon barrier (%@) มีชื่อข้อมูลมาตราส่วนเชิงบรรยายไม่ถูกต้อง";
"Polygon barrier (%@) does not cover any network elements." = "Polygon barrier (%@) ไม่ครอบคลุมส่วนประกอบเน็ตเวิร์คใดๆ";
"'%@' is an invalid impedance attribute." = "'%@' เป็นคุณลักษณะการต้านทานที่ไม่ถูกต้อง";
"'%@' restriction attribute is invalid." = "'%@' ข้อมูลข้อกำหนดเชิงบรรยายไม่ถูกต้อง";
"'%@' accumulate attribute is invalid." = "'%@' ข้อมูลการรวบรวมเชิงบรรยายไม่ถูกต้อง";
"'%@' is an invalid directions time attribute." = "'%@' เป็นข้อมูลเวลาเชิงบรรยายที่ไม่ถูกต้อง";
"Directions distance attribute is invalid." = "ข้อมูลระยะทางไม่ถูกต้อง";
"Invalid attribute parameter attribute name (%@)." = "ชื่อข้อมูลตัวแปรไม่ถูกต้อง (%@).";
"Invalid attribute parameter parameter name (%@)." = "ชื่อข้อมูลตัวแปรไม่ถูกต้อง (%@).";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "ประเภทค่าไม่ถูกต้องสำหรับข้อมูล (%1$@) ตัวแปร (%2$@).";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "ค่ากำหนดการใช้ไม่ถูกต้องสำหรับข้อมูล (%1$@) ตัวแปร (%2$@).";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "ค่ากำหนดการใช้งานเป็นกลางสำหรับข้อมูล (%1$@) ตัวแปร (%2$@).";
"Soft restricted element (%@) was traversed." = "องค์ประกอบการกำหนดขอบเขต (%@) ได้รับการสำรวจ";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "เน็ตเวิร์คไม่มีข้อมูลลำดับศักดิ์สำหรับการวางแผนเส้นทางตามลำดับศักดิ์";
"No path can be found between a given pair of stops (%@)." = "ไม่พบเส้นทางระหว่างจุดต่างๆที่ให้มา (%@).";
"The input spatial reference is undefined." = "ระบบพิกัดของข้อมูลนำเข้าไม่ได้ถูกระบุ";
"The output spatial reference is undefined." = "ระบบพิกัดของผลลัพธ์ไม่ได้ถูกระบุ";
"The directions style is invalid." = "สไตล์ทิศทางไม่ถูกต้อง";
"The directions language is invalid." = "ภาษาทิศทางไม่ถูกต้อง";
"Directions time and distance attributes do not match." = "ข้อมูลเวลาทิศทางและระยะไม่ตรงกัน";
"The directions road class attribute is invalid." = "ข้อมูลประเภทถนนไม่ถูกต้อง";
"Unknown condition." = "เงื่อนไขที่ไม่รู้จัก";
"Invalid route task parameters." = "ตัวแปรการวางแผนเส้นทางไม่ถูกต้อง";
"Route task's solution cannot be found." = "ไม่พบผลลัพธ์การวางแผนเส้นทาง";
"Route task was cancelled." = "การวางแผนเส้นทางถูกยกเลิก";
"Route task internal error." = "ข้อผิดพลาดภายในการวางแผนเส้นทาง";
"Route name property is not supported for local route task." = "ไม่รองรับคุณสมบัติชื่อเส้นทางสำหรับการวางแผนเส้นทางท้องถื่น";
"Local route task parameters should be retrieved from route task." = "ตัวแปรการวางแผนเส้นทางในท้องที่ควรจะถูกกู้คืนมาจากงานการวางแผนเส้นทาง";
"Cannot retrieve network description." = "ไม่สามารถกู้คืนคำอธิบายเน็ตเวิร์คได้";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "สามารถกำหนด impedanceAttributeName และ accumulateAttributeNames ได้ด้วยความยาวหนึ่ง Attribute เท่านั้น";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "สามารถกำหนด  impedanceAttributeName และ accumulateAttributeNames ได้ด้วย Atrribute เพียงหนึ่งครั้ง";
"Service not supported." = "ไม่รองรับเซอร์วิส";
"Specified start time occurs before January 1, 1970." = "วันเวลาเริ่มต้นที่ระบุเกิดขึ้นก่อนวันที่ 1 มกราคม ปี ค.ศ. 1970";
"Stop (%@) has a start time that occurs before January 1, 1970." = "จุด (%@) มีเวลาเริ่มต้นเมื่อก่อนวันที่ 1 มกราคม ค.ศ. 1970";
"Stop (%@) has a local time window that starts before January 1, 1970." = "จุด (%@) มีเวลาท้องถิ่งเริ่มก่อนวันที่ 1 มกราคม ค.ศ. 1970";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "จุด (%@) มีเวลา UTC  เริ่มก่อนวันที่ 1 มกราคม ค.ศ. 1970";
"Stop (%@) has a time window end that occurs before its time window start." = "หยุด (%@) เมื่อหน้าต่างสิ้นสุดการทำงานซึ่งจะแสดงขึ้นก่อนที่หน้าต่างจะเริ่มทำงาน";

/* Unit Abbreviated strings */
"cm" = "ซม.";
"dd" = "ว";
"dm" = "วด";
"ft" = "ฟุต";
"in" = "น";
"km" = "กม.";
"m" = "ม";
"mi" = "ไมล์";
"mm" = "มม.";
"nm" = "นม.";
"pt" = "pt";
"Unknown" = "ไม่ทราบ";
"yd" = "ป ด";

/* Unit Display Strings */
"Centimeters" = "เซ็นติเมตร";
"Decimal Degrees" = "เดซิมอล ดีกรี";
"Decimeters" = "เดซิเมตร";
"Feet" = "ฟุต";
"Inches" = "นิ้ว";
"Kilometers" = "กิโลเมตร";
"Meters" = "เมตร";
"Miles" = "ไมล์";
"Millimeters" = "มิลลิเมตร";
"Nautical Miles" = "ไมล์ทะเล";
"Points" = "จุด";
"Yards" = "หลา";

/* Area Units Abbreviated Strings */
"sq. in" = "ตร.น.";
"sq. ft" = "ตร.ฟ.";
"sq. yd" = "ตร.หลา";
"ac" = "เอเคอร์";
"sq. mi" = "ตร.ไมล์";
"sq. mm" = "ตร.มม.";
"sq. cm" = "ตร.ซม.";
"sq. dm" = "ตร.ดม.";
"sq. m" = "ตร.ม.";
"ares" = "ares";
"ha" = "ha";
"sq. km" = "ตร.กม.";

/* Area Units Display Strings */
"Square Inches" = "ตารางนิ้ว";
"Square Feet" = "ตารางฟุต";
"Square Yards" = "ตารางหลา";
"Acres" = "เอเคอร์";
"Square Miles" = "ตารางไมล์";
"Square Millimeters" = "ตารางมิลลิเมตร";
"Square Centimeters" = "ตารางเซนติเมตร";
"Square Decimeters" = "ตารางเดซิเมตร";
"Square Meters" = "ตารางเมตร";
"Ares" = "Ares";
"Hectares" = "เฮกตาร์";
"Square Kilometers" = "ตารางกิโลเมตร";

/* Errors */
"Error" = "ข้อผิดพลาด";
"Class not @protocol AGSCoding compliant" = "คลาสไม่เข้ากันกับ @protocol AGSCoding";
"Authorization required" = "ต้องได้รับอนุญาต";
"Token is invalid or has expired" = "Token ไม่ถูกต้องหรือหมดอายุ";
"Unknown error occurred" = "เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุ";
"Empty username/password" = "ชื่อผู้ใช้/รหัสผ่านว่างเปล่า";
"Token URL is nil. You must set a valid token URL on the credential." = "Token URL ว่างเปล่า คุณต้องใส่ Token URL ที่ถูกต้อง";
"Unknown authentication error" = "ข้อผิดพลาดการพิสูจน์ที่ไม่ทราบสาเหตุ";
"Error extracting identity" = "ข้อผิดพลาดการแยกลักษณะ";
"Error adding identity to the keychain" = "การเพิ่มลักษณะให้คีย์เชนผิดพลาด";
"Invalid Credentials" = "ข้อมูลส่วนตัวใช้ไม่ได้";
"Bad URL." = "URL เสีย";
"The feature layer does not expose an object-id field." = "ชั้นข้อมูลฟีเจอร์ไม่แสดงฟิลด์รหัสวัตถุ";
"Both geodatabase and syncParams are required for this method." = "ต้องการทั้ง Geodatabase และ syncParams สำหรับขั้นตอนนี้";
"Uploading deltas is not supported with this replica." = "ไม่รองรับการอัพโหลด Delta ด้วยตัวคัดลอกนี้";
"Error creating delta geodatabase" = "การสร้าง Delta Geodatabase ผิดพลาด";
"Unable to create result image layer" = "ไม่สามารถสร้างชั้นข้อมูลภาพถ่ายผลลัพธ์ได้";
"Cache at path '%@' not found." = "ไม่พบแคชที่ '%@'";
"To add an item, you must be logged in to the portal." = "คุณต้องลงชื่อเข้าใช้ใน Portal เพื่อเพิ่มวัตถุ";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "คุณต้องระบุค่าใน AGSPortalItemContentParameters เพื่อเพิ่มวัตถุ";
"The portal failed to add the item." = "Portal เพิ่มวัตถุล้มเหลว";
"To delete an item, you must be logged in to the portal." = "คุณต้องลงชื่อเข้าใช้ใน Portal เพื่อเพิ่มลบวัตถุ";
"The portal failed to delete the item." = "Portal ลบวัตถุล้มเหลว";
"To update an item, an itemId and logged in user are required." = "เพื่ออัพเดตวัตถุ ต้องลงชื่อเข้าใช้และมีรหัสวัตถุ";
"The item failed to update." = "วัตถุอัพเดตล้มเหลว";
"The item failed to update JSON." = "วัตถุอัพเดต JSON ล้มเหลว";
"You must be logged in to a portal to add a comment." = "คุณต้องลงชื่อเข้าใช้สู่ Portal เพื่อแสดงความคิดเห็น";
"The comment failed to be added." = "ไม่สามารถเพิ่มความคิดเห็นได้";
"You must be logged in to a portal to fetch the current user's rating." = "คุณต้องลงชื่อเข้าใช้ใน Portal เพื่อรับค่าคะแนนผู้ใช้ปัจจุบัน";
"You must be logged in to a portal to add a rating." = "คุณต้องลงชื่อเข้าใช้ใน Portal เพื่อเพิ่มคะแนน";
"The rating failed to be added." = "การเพิ่มคะแนนล้มเหลว";
"To share an item, you must be logged in to the portal." = "คุณต้องลงทะเบียนเข้าใช้ใน Portal เพื่อแชร์ข้อมูล";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "เพื่อยกเลิกการแชร์วัตถุ คุณต้องลงชื่อเข้าใช้ใน Portal และระบุกลุ่มที่ไม่ต้องการแชร์ข้อมูล";
"Bad Request" = "คำขอเสีย";
"Credential Required" = "ต้องการ AGSCredential";
"Job not created" = "งานยังไม่ได้ถูกสร้าง";
"Service did not return a valid URL" = "เซอร์วิสไม่มี URL ที่ถูกต้อง";
"Service did not return a file" = "เซอร์วิสไม่ได้ส่งไฟล์กลับมา";
"Service did not return a size" = "เซอร์วิสไม่ได้ส่งขนาดกลับมา";
"Job failed" = "งานล้มเหลว";
"Job timed out" = "งานหมดเวลา";
"Job was cancelled" = "งานถูกยกเลิก";
"Job was deleted" = "งานถูกลบทิ้ง";
"Feature with objectId: %d not found" = "ไม่พบฟีเจอร์รหัส : %d";
"No object-id values specified for feature table query." = "ไม่ได้ระบุค่ารหัสวัตถุสำหรับเงื่อนไขฟีเจอร์";
"Geodatbase at path '%@' not found." = "ไม่พบไฟล์ Geodatabase '%@' ที path นี้";
"An error occured when creating the local Geodatabase" = "เกิดข้อผิดพลาดขณะสร้างไฟล์ Geodatabase";
"Operation not supported for Geodatabase Feature Service Table" = "การทำงานไม่สนับสนุนตารางเซอร์วิสฟีเจอร์ของ Geodatabase";

/* OAuth */
"The specified clientID is invalid" = "ClientID ที่ระบุไม่ถูกต้อง";
"Log In" = "เข้าใช้งานระบบ";

/* Sync */
"Upload is not supported with this service." = "ไม่รองรับการอัพโหลดด้วยเซอร์วิสนี้";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "ในการเรียกซิงค์ จำต้องระบุมากกว่า AGSGDBSyncDirectionNone";